<template>
  <div>
    저에겐 어떤 일을 맡게 된다면 그 일을 요청한사람에게 맞추어서 원하는 결과물을 만들어내려고 하는 성향이 있습니다.<br>
    '책임감'이라는 말보다는 '요청'이라는 것에 대한 결과물이 상상 이상이 였을 때,<br>
    그 기분을 너무 좋아하며 나누고 싶다고 생각합니다.<br>
    <br>
    첫 회사에 입사한 저에게 IT 업무를 해결하는 능력은 그렇게 높지 않았습니다.<br>
    그래서 처음에는 제가 해결한 문제들이 회사의 입장에서 그렇게 많은 기대감을 보이지 않았었습니다.<br>
    '실망', 기대하지 않았다라는 느낌을 많이 받았었습니다.<br>
    다만 저의 위의 성향이 당면한 문제들을 해결하는 데에 있어 많은 도움을 주었습니다.<br>
    시간을 쪼개어 따로 학습도 하고, 회사의 업무를 이해하려 하고 회사의 입장에 조금씩 다가가면서<br>
    조금씩 부족한 부분을 채워가고 있다 보니 개발팀장 직책을 맡게 되었고, 짧은시간에 많은 연봉상승이 있었습니다.<br>
    <br>
    회사의 짧은시간에 개발의 전체적인 부분을 담당하는 팀장자리에 있다보니 많은 부분을 결정하고 제안도 해야했으며,<br>
    해결도 하게 되었습니다.<br>
    개발자의 입장, 직장 상사의 입장, 회사 대표의 입장, 클라이언트의 입장... 모두를 다 만족시 킬 수는 없었지만,<br>
    여러 입장에서 생각해보게 되며 각자의 입장에 대한 정답들을 찾으려고 노력하였습니다.<br>
    그러다 보니 많은 문제들을 효과적으로 해결하기 위해서는 '정답'이 여러가지라는 것을 깨달았습니다.<br>
    여러가지 정답을 제시하다 보면 클라이언트 혹은 직장상사로부터 그런걸 '원했다'라는 말을 듣게 되고,<br>
    이를 적용하게되면 그저 짧게 생각한 '정답'보다는 더 기분좋게 문제를 해결할 수 있었으며, 성과에 대한 평가도 좋았습니다.<br>
    <br>
    개발이슈를 해결할 때, 실제 서비스를 유지하면서 개발을 하다보니 '개별'테스트라는 것을 많이하게 되었습니다.<br>
    이슈가 생긴곳을 '캡쳐'라는 말 비슷하게 떼어와서 테스팅할 수 있는 능력이 필요 했고,<br>
    환경을 동일하게 구축해야된다는 것을 느끼게 되었습니다.<br>
    개발부분의 함수에서부터 페이지, 혹은 업무 전반적인 프로세스에서의 어느 한 부분으로부터 시작하는 문제...<br>
    다양한 문제들이 속한 전체환경을 구현하고, 실제로 이슈가 된부분만을 테스팅하는 환경구성능력에 대한<br>
    방법들을 찾다보니 이를 해결 할 수 있는 노하우가 생기게 된것 같습니다.<br>
    <br>
    실제로 업무하는 부분에 전반적인 데이터들이 데이터베이스에 제대로 들어가지 않아서 많은 이슈가 생기는걸 인지하고,<br>
    해당부분을 처리하는 프로그램을 개발하고 자체 서비스를 진행하여서 많은 부분에 있어서 시간을 절약하고,<br>
    서비스의 안정성을 확보하여 좋은 평가를 받았습니다.
  </div>
</template>
<script>
export default {
  
}
</script>
<style lang="scss" scoped>
div {
  padding: 3rem;
  background-color: #fff;
  box-shadow: 0 4px 8px 0 rgba(0, 0, 0, 0.2);
  font-size: 1.3rem;
  line-height: 1.6em;
}
</style>
